package main

func main() {
	//var имя [длина]тип
	//
	//var a [5]int     // массив из 5 целых чисел (по умолчанию все 0)
	//var b [3]float64 // массив из 3 чисел с плавающей точкой (все 0.0)
	//var c [2]string  // массив из 2 строк (пустые строки "")
	//var d [4]bool    // массив из 4 логических значений (все false)
	//
	//var arr1 = [5]int{10, 20, 30, 40, 50}
	//arr2 := [3]string{"Go", "Java", "Python"}
	//
	//arr3 := [5]int{1, 2}          // [1, 2, 0, 0, 0]
	//arr4 := [4]float64{1.5, 2.5}  // [1.5, 2.5, 0, 0]
	//
	//arr5 := [5]int{1: 100, 3: 200} // [0, 100, 0, 200, 0]
	//
	//arr6 := [...]int{5, 6, 7, 8} // длина будет 4
}
